app/Models/M_kapal.php

    public function ambilData($id = false)
    {
        if ($id === false) {
            return $this->db->table($this->table)->get()->getResult();
---
SELECT *
FROM `kapal`