app/Models/M_pengguna.php

	public function ambilData($id = false)
	{
		if ($id === false) {
			return $this->db->table($this->table)->get()->getResult();
		} else {
			return $this->getWhere(['id_pengguna' => $id]);
---
SELECT *
FROM `pengguna`
SELECT *
FROM `pengguna`
WHERE `id_pengguna` = '2'

	public function simpan($data)
	{
		$simpan = $this->db->table($this->table);
		return $simpan->insert($data);
---
INSERT INTO `pengguna` (`nm_pengguna`, `email`, `jk`, `nohp`, `password`, `level`) VALUES ('Udang', 'admin@gmail.com', 'Perempuan', '234', '234', 'Pengguna')