app/Models/M_pesantiket.php

    public function ambilData($id = false)
    {
        if ($id === false) {
            return $this->db->table($this->table)->get()->getResult();
---
SELECT *
FROM `pesantiket`

    public function cariId($id)
    {
        return $this->db->table($this->table)
            ->join('rekening', 'rekening.id_pembayaran=pesantiket.id_pembayaran')
            ->where(['id_pengguna' => $id])->get()->getResult();
---
SELECT *
FROM `pesantiket`
JOIN `rekening` ON `rekening`.`id_pembayaran`=`pesantiket`.`id_pembayaran`
WHERE `id_pengguna` IS NULL