app/Models/M_rekening.php

	public function ambilData($id = false)
	{
		if ($id === false) {
			return $this->db->table($this->table)->get()->getResult();
		} else {
			return $this->getWhere(['id_pembayaran' => $id]);
---
SELECT *
FROM `rekening`
SELECT *
FROM `rekening`
WHERE `id_pembayaran` = '9'